src/DataProcessors/Scan_РМОтделаЛогистики/Scan_РМОтделаЛогистики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Scan_РМОтделаЛогистики</name>
</mdclass:DataProcessor>

src/InformationRegisters/Scan_ПраваИНастройки/Scan_ПраваИНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ПраваИНастройки</name>
  <comment>Хранит права доступа и настройки окружения пользователей</comment>
  <resources>
    <name>Значение</name>
    <comment>Значение права / настройки</comment>
    <type>
      <types>Characteristic.Scan_ПраваИНастройки</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, на уровне которого производится настройка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравоНастройка</name>
    <comment>Право или настройка, по которой хранится значение</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.Scan_ПраваИНастройки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ИсторияИзмененияПравИНастроек/Scan_ИсторияИзмененияПравИНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ИсторияИзмененияПравИНастроек</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <comment>Значение права / настройки</comment>
    <type>
      <types>Characteristic.Scan_ПраваИНастройки</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, на уровне которого производится настройка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравоНастройка</name>
    <comment>Право или настройка, по которой хранится значение</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.Scan_ПраваИНастройки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/Scan_РМОтделаЛогистики/Forms/ФормаНастройкиОтображенияЗакладок/Module.bsl
// rarus tenkam 17.04.2020 mantis 15715 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь = Параметры.Пользователь;
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	КонецЕсли;
	ЗаполнитьНастройкиПользователя();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПользователя()
	МассивНастроек = Обработки.Scan_РМОтделаЛогистики.ПолучитьНастройкиОтображенияЗакладок(Пользователь);
	Для Каждого ТекСтрока Из МассивНастроек Цикл
		НоваяСтрока = НастройкиОтображенияЗакладок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.Закладка = Обработки.Scan_РМОтделаЛогистики.ПолучитьСинонимЗакладки(ТекСтрока.Закладка);
		НоваяСтрока.СтароеЗначение = НоваяСтрока.Значение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсе(Команда)
	Для Каждого ТекСтрока Из НастройкиОтображенияЗакладок Цикл
		ТекСтрока.Значение = Истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсе(Команда)
	Для Каждого ТекСтрока Из НастройкиОтображенияЗакладок Цикл
		ТекСтрока.Значение = Ложь;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();		
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	Для Каждого ТекСтрока Из НастройкиОтображенияЗакладок Цикл
		Если ТекСтрока.СтароеЗначение <> ТекСтрока.Значение Тогда			
			МенеджерРС = РегистрыСведений.Scan_ПраваИНастройки.СоздатьМенеджерЗаписи();
			МенеджерРС.Объект = Пользователь;
			МенеджерРС.ПравоНастройка = ТекСтрока.Настройка;
			МенеджерРС.Значение = ТекСтрока.Значение;
			МенеджерРС.Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();		
			МенеджерРС.Записать();
			
			Рег2 = РегистрыСведений.Scan_ИсторияИзмененияПравИНастроек.СоздатьМенеджерЗаписи();
			Рег2.Период = ТекущаяДата();
			Рег2.Объект = Пользователь;
			Рег2.ПравоНастройка = ТекСтрока.Настройка;
			Рег2.Значение = ТекСтрока.Значение;
			Рег2.Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
			Рег2.Записать();			
		КонецЕсли;
	КонецЦикла	
КонецПроцедуры
// rarus tenkam 17.04.2020 mantis 15715 ---
